Docs/Reference/Content/images/dependencies/net8.0/d2/alloverit-reactiveui-wpf.d2
direction: left

aoi: AllOverIt
aoi.alloverit-reactiveui-wpf: AllOverIt.ReactiveUI.Wpf
reactiveui-wpf_23-2-28: ReactiveUI.WPF\nv23.2.28
dynamicdata_9-4-31: DynamicData\nv9.4.31
reactiveui_23-2-28: ReactiveUI\nv23.2.28
splat_19-4-1: Splat\nv19.4.1
system-reactive_6-1-0: System.Reactive\nv6.1.0
aoi.alloverit-reactiveui: AllOverIt.ReactiveUI
microsoft-extensions-dependencyinjection-abstractions_10-0-9: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.9
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
reactiveui-wpf_23-2-28 <- aoi.alloverit-reactiveui-wpf
dynamicdata_9-4-31 <- reactiveui-wpf_23-2-28
reactiveui_23-2-28 <- reactiveui-wpf_23-2-28
splat_19-4-1 <- reactiveui-wpf_23-2-28
system-reactive_6-1-0 <- reactiveui-wpf_23-2-28
aoi.alloverit-reactiveui <- aoi.alloverit-reactiveui-wpf
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- aoi.alloverit-reactiveui
reactiveui_23-2-28 <- aoi.alloverit-reactiveui
dynamicdata_9-4-31 <- reactiveui_23-2-28
splat_19-4-1 <- reactiveui_23-2-28
system-reactive_6-1-0 <- reactiveui_23-2-28
aoi.alloverit <- aoi.alloverit-reactiveui
aoi.alloverit-assertion <- aoi.alloverit
reactiveui-wpf_23-2-28.style.fill: "#ADD8E6"
reactiveui-wpf_23-2-28.style.opacity: 0.8
dynamicdata_9-4-31.style.fill: "#FFEC96"
dynamicdata_9-4-31.style.opacity: 0.8
reactiveui_23-2-28.style.fill: "#ADD8E6"
reactiveui_23-2-28.style.opacity: 0.8
splat_19-4-1.style.fill: "#FFEC96"
splat_19-4-1.style.opacity: 0.8
system-reactive_6-1-0.style.fill: "#FFEC96"
system-reactive_6-1-0.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
